a = 1
b = 2
c = 3
print("Изначальные переменные: a -", a, ", b -", b, ", c -", c) #создали несколько изначальных переменных
a = int(input("Введите число a: "))
b = int(input("Введите число b: "))
c = int(input("Введите число c: "))
print("Теперь переменные следующие: a - ", a, ", b - ", b, ", c - ", c) #пользователь ввёл числа и мы их вывели на экран
a = input("А теперь давайте запишем в переменную 'a' слово или число: ")
b = input("То же самое сделаем с переменной 'b': ")
c = input("...и повторим это с переменной 'c': ")
print("Теперь наши переменые выглядят так: a - ", a, ", b - ", b, ", c - ", c) #запросили строчные значения